{"pageProps":{"page":{"slug":"about","layout":"page","title":"همکاری","content":"\nلینوکسی‌ها یک بستر باز برای کاربران گنو/لینوکسی است که می‌خواهند مطالب خود را در آن منتشر کنند و علاوه بر کمک به کاربران دیگر، **کسب درآمد** نیز داشته باشند.\n\nما از شما عزیزانی که با توزیع‌های لینوکس آشنایی دارید، دعوت می‌کنیم که جهت بالا بردن سطح کیفی و کمی مطالب با ما همکاری کنید. همچنین از وبلاگ نویسان حیطه لینوکس دعوت می‌کنیم که مطالب خود را در سایت لینوکسی‌ها منتشر کنند تا با توجه به امکانات خاص سایت مانند شبکه‌های اجتماعی، سئو قوی و ... کاربران لینوکس بیشتری به مطالب شما دسترسی داشته باشند و از طریق انتشار مطالب نیز کسب درآمد داشته باشید.\n\nبرای همکاری با ما کافیست یک اکانت از سایت [گیت‌هاب](https://github.com) داشته باشید و مراحل زیر را طی کنید.\n\nبعد از ورود به اکانت گیت‌هاب خود، وارد صفحه‌ی پروژه‌ی لینوکسی‌ها در گیت‌هاب با آدرس [https://github.com/linuxihaa/linuxihaa.github.io](https://github.com/linuxihaa/linuxihaa.github.io) شوید و از گوشه‌ی بالا و سمت راست، دکمه‌ی Fork را بزنید. سپس تغییرات لازم مانند اضافه کردن مطلب به سایت را انجام داده و در آخر دکمه‌ی Pull Request را در صفحه‌ی پروژه فورک شده‌ی خود را بزنید تا تغییرات شما بعد از بررسی، در سایت اصلی منتشر شود.\n\nبرای مثال می‌توانید بعد از فورک کردن پروژه، دستور زیر را در ترمینال وارد کنید.\n\n```sh\ngit clone YOUR_FORK\n```\n\nبعد از آن تغییرات لازم مانند اضافه کردن مطلب را اعمال کنید و در آخر دستورات زیر را وارد کنید.\n\n```sh\ngit add --all\n```\n\n```sh\ngit commit -m \"Your comment\"\n```\n\n```sh\ngit push -u origin master\n```\n\nو در آخر از دکمه‌ی Pull Request در صفحه‌ی گیت‌هاب فورک خود استفاده کنید تا تغییرات برای بررسی به دست ما برسد. شما همچین می‌توانید علاوه بر انتشار مطلب در موارد دیگر توسعه سایت نیز به ما کمک کنید.\n\nمطالب در شاخه‌ی pages/dynamic_ قرار دارند و از فرمت Markdown استفاده می‌کنند و برای راحتی در ویرایش متون با این فرمت می‌توانید از ویرایشگر صفحات در گیت‌هاب یا [http://linuxihaa.ir/ckeditor](http://linuxihaa.ir/ckeditor) استفاده کنید و بعد از ویرایش متن، دکمه‌ی Markdown را زده و خروجی را دریافت کنید.\n\nنام هر فایل در شاخه pages/dynamic_ مسیر URL مطلب شما در سایت خواهد بود.\n\nعلاوه بر متن اصلی هر مطلب، متغییرهایی نیز باید در ابتدای متن تعیین شوند که به شکلی مانند مثال زیر در اول متن قرار می‌دهید.\n\n```sh\nlayout: post  \njdate: 1395-05-14\nuser: rmasoumvand  \ntitle: راه اندازی DNS Server لینوکس\ncategories:\n- آموزشی\ntags:\n- شبکه\n- سرور\nfeatured: dns-server-linux.jpg  \nkeywords:\n- dns server لینوکس\n- bind9\ndescription: آموزش راه اندازی DNS Server لینوکس\n```\n\n*   layout که باید post بگذارید (مثال layout: post).\n*   jdate که حتما باید تعیین شود تا تاریخ شمسی برای مطلب مشخص شود (مثال 1395-04-18).\n*   user که شناسه کاربری شما در پروژه‌ی ما است و در ادامه بیشتر توضیح داده می‌شود.\n*   title که عنوان مطلب است.\n*   categories که دسته‌ی مطلب است و با اینکه به‌صورت آرایه‌ای قابل تعریف است اما شما حتما یک مورد و آن هم «آموزشی» قرار دهید. دسته‌ی دیگر «خبری» است که به خبرهای مربوط به سایت اختصاص دارد.\n*   tags که برچسب‌های مطلب است و می‌تواند چند مورد تعیین شود که هر مورد در خط جدا و ابتدای خط - قرار می‌گیرد. برچسب‌ها باید به‌گونه‌ای باشند که مجموعه‌ای از مطالب قبلی یا مطالب آتی را پوشش دهند و حدالامکان باید از برچسب‌های فعلی سایت باشند. برچسب با کلیدواژه متفاوت است و مثلاً اگر مطلب شما درباره‌ی برنامه‌ی X است، کلیدواژه مطلب X است اما برچسب مطلب می‌تواند عبارت «نرم‌افزار» و دسته‌ی نرم‌افزار مانند مرورگر باشد.\n* featured که تصویر شاخص مطلب است و می‌توانید بعد از قرار دادن تصویر در شاخه‌ی public/images نام فایل آن را در این قسمت بنویسید.\n*   keywords که کلیدواژه‌های مطلب است و حداکثر ۵ مورد باید باشد و اولین کلیدواژه مهمترین آن باشد. کلیدواژه‌ها نباید کلی باشند.\n*   description که توضیحاتی مختصری درباره‌ی مطلب است و باید از ۸۰ حرف بیشتر و از ۱۵۰ حرف کمتر باشد.\n\nبرای درج کد در متن می‌توانید از مثال زیر استفاده کنید و به‌جای sh java javascript ... زبان کد را بنویسید.\n\n\n```sh\n\"```sh\nping linuxihaa.ir\n```\"\n```\n\nتصاویر را نیز می‌توانید در شاخه‌ی public/images قرار دهید و با کدی شبیه به کد زیر از آن‌ها استفاده کنید.\n\n```sh\n![IMAGE_TITLE](/images/IMAGE_FILENAME)\n```\n\nشما می‌توانید اطلاعات خود را در شاخه‌ی public/articles/authors و فایل users.yml اضافه کنید تا نام، آدرس و دیگر مشخصات مورد نظر شما، زیر مطالب نگارش شده شما نمایش داده شود. این مشخصات شامل موارد زیر هستند که زیر خطی که اول آن ID: نوشته شده است می‌آیند و ID شناسه شما است که در مطالب خود توسط متغییر user به آن اشاره می‌کنید.\n\n*   name که نام شما است.\n*   url که می‌تواند آدرس سایت یا ... شما باشد و یا آن را به‌صورت mailto: email تعریف کنید تا لینک برای ایمیل دادن به شما باز شود.\n*   email که ایمیل شما است که باید حتما تعیین شود در مواردی مانند تماس‌ها و بارگذاری آواتار شما کاربرد دارد.\n*   bio که یک توضیح مختصری از خودتان است.\n*   donate که لینکی از شما برای دریافت حمایت است و زیر مطالب نمایش داده می‌شود. برای این کار می‌توانید از سیستم‌هایی مانند آسان‌پرداخت زرین‌پال استفاده کنید و لینک پرداخت را اینجا قرار دهید.\n*   advimg که اگر تعیین شود به‌صورت پیش‌فرض در زیر تمام مطالب شما این تصویر برای تبلیغات نمایش داده می‌شود.\n*   advurl که لینک مرتبط با تصویر تبلیغاتی است.\n\nبرای اطلاعات بیشتر در مورد فرمت Markdown به [راهنمای گیت هاب](https://guides.github.com/features/mastering-markdown/) مراجعه کنید و\nدر صورت داشتن سوال با ما تماس بگیرید.\n\nلینوکسی‌ها\n","jdate":"Invalid date"}},"__N_SSG":true}