{"pageProps":{"page":{"slug":"2013-10-16_lamp-debian","layout":"post","jdate":"Wed Oct 16 2013 00:00:00 GMT+0000","user":"misam","title":"راه اندازی LAMP در دبیان و اوبونتو","categories":["آموزشی"],"tags":["سرور","اوبونتو","دبیان"],"featured":"lamp.jpg","keywords":["lamp","اوبونتو lamp","دبیان lamp","ubuntu lamp","debian lamp"],"description":"راه اندازی lamp در دبیان و اوبونتو","timeToRead":10,"content":"\nکاربرانی که از اوبونتو برای مدیرت سرور خود استفاده می‌کنند و یا کاربران اوبونتو دسکتاپ که قصد ایجاد لوکال هاست را برای آزمایش پروژه‌های وب خود دارند حتما نیازمند راه‌اندازی LAMP روی سیستم عامل خود هستند. البته مدیران سرور اکثرا ترجیح می‌دهند از کنترل‌پنل‌های آماده (و اکثرا معروف) برای این‌کار استفاده کنند زیرا راه اندازی راحتی دارند، مدیریت آسان‌تر با قابلیت‌های زیادی در اختیار کاربران قرار می‌دهند و کنترل امنیت شبکه را نیز به راحتی امکان پذیر می‌کنند. این کنترل‌پنل‌ها قبل از نصب لمپ را در سیستم شما راه اندازی می‌کنند و بعد برنامه‌ای برای مدیریت در اختیار شما قرار می‌دهند.\n\nو اما کاربران دسکتاپ که نیاز به لوکال‌هاست دارند؛ این کاربران نیز می‌توانند از برنامه‌های آماده برای راه اندازی لمپ در سیستم خود استفاده کنند که نرم‌افزار گرافیکی برای مدیریت نیز در اختیار کاربر می‌گذارند.\n\nاما بگذاریم حرفه‌ای تر کار کنیم! بگذارید خودمان تمام کارها را انجام بدهیم، کمی یاد بگیریم و منابع کمتری از سیستم را اشغال کنیم. بگذارید لمپ ساده‌ای را خودمان راه اندازی کنیم (این کار به مدیران سرور توصیه ‌نمی‌شود و بهتر است از کنترل‌پنل‌های قدرتمندی نظیر سی‌پنل استفاده کنید تا امنیت بیشتری برای شما تضمین شود و کاربران شما نیز راحت‌تر باشند).\n\n![](/images/lamp.jpg)\n\nکلمه LAMP از Linux, Apache, MySQL, PHP تشکیل شده است و لینوکس آن بخاطر راه‌اندازی در سیستم لینوکس است و در دیگر سیستم‌عامل‌ها این عبارت بسته به حرف اول اسم آن تغییر می‌کند. مانند WAMP برای ویندوز و MAMP برای مک.\n\nپس تمام چیزهایی که باید نصب کنیم عبارتند از؛ آپاچی، مای‌اس‌کیو‌ال و پی‌اچ‌پی. و اما روش و ترتیب نصب.\n\n### نصب آپاچی Apache\n\nاول از همه از دستور زیر برای نصب آپاچی در ترمینال استفاده کنید.\n\n```sh\nsudo apt-get install apache2\n```\n\nبعد از نصب آپاچی در مرورگر خود آدرس http://localhost را بزنید و در صورتی که آپاچی به درستی نصب شده باشد صفحه‌ای با محتوای اطلاعات وب‌سرور آپاچی در مرورگر نمایش داده می‌شود.\n\n### نصب پی‌اچ‌پی PHP\n\nاکنون بیایید پی‌اچ‌پی را نصب کنیم.\n\n```sh\nsudo apt-get install php5 libapache2-mod-php5\n```\n\nحالا بیایید پی اچ پی نصب شده را امتحان کنیم. از دستور زیر برای ایجاد فایلی در آدرس مورد نظر استفاده کنید. دسترسی این آدرس روت است و باید از sudo برای دسترسی به آن استفاده کنید (جلوتر می‌گویم که چگونه با دسترسی عادی کار کنید).\n\n```sh\nsudo gedit /var/www/html/test.php\n```\n\nدر فایل ایجاد شده کد `<?php phpinfo(); ?>` را بنویسید. و بعد از ذخیره در مرورگر آدرس http://localhost/test.php زیر را وارد کنید. اگر همه چیز به درستی انجام شده باشد باید لیست کاملی از تنظیمات پی‌اچ‌پی خود را مشاهده کنید.\n\n### نصب مای‌اس‌کیو‌ال MySQL\n\nاکنون زمان آن رسیده است که سرور دیتابیس نصب کنیم. یعنی مای‌اس‌کیو‌ال که برای لینوکس تهیه شده است.\n\n```sh\nsudo apt-get install mysql-server\n```\n\nتمام شد! لمپ شما راه‌اندازی شد. می‌توانید دستورات پی‌اچ‌پی خود را بنویسید، از دیتابیس با کوئری توسط کاربری روت آن استفاده کنید و از طریق لوکال هاست آن را اجرا کنید.\n\nاما حتما شما نیاز به راه ساده‌ای برای مدیریت دیتابیس‌های خود می‌خواهید و دوست ندارید همه کارها را با کوئری دادن انجام دهید. برای این‌کار از برنامه تحت وب پی‌اچ‌پی-مای-ادمین می‌توانید استفاده کنید که هم رایگان است و هم محیط کاربری خوب با قابلیت‌های بالایی در اختیار شما می‌گذارد. از برنامه‌های مشابه دیگر هم می‌توانید استفاده کنید.\n\n### نصب پی‌اچ‌پی‌مای‌ادمین phpMyAdmin\n\nدر ترمینال دستور زیر را وارد کنید و در مراحل نصب پسورد مای‌اس‌کیوال خود را هنگام نیاز وارد کنید و هنگامی که از شما وب‌سرویس را می‌پرسد، تیک  apache2 را بزنید.\n\n```sh\nsudo apt-get install php5-mysql phpmyadmin\n```\n\n* همانطور که در بخش آزمایش درست عمل کردن پی‌اچ‌پی دیدیم؛ هر فایل php که بخواهد در لوکال‌هاست ما اجرا شود باید در مسیر var/www/html قرار گیرد که این مسیر دسترسی روت دارد و برای هر تغییری ما باید از دسترسی روت استفاده کنیم. برای این‌که کار ما راحت شود اول در پوشه‌های خود پوشه‌ای برای کارهای وب خود بسازید (مثلاً web در home خود) و سپس توسط دستور زیر در ترمینال لینکی از پوشه را در مسیر var/www قرار دهید.\n\n```sh\nsudo ln -sf ~/web /var/www/html/\n```\n\nاز این به بعد کافیست فایل‌های خود را در پوشه web ذخیره کنید و سپس در مرورگر از آدرس http://localhost/web اجرا کنید."}},"__N_SSG":true}