{"pageProps":{"page":{"slug":"2013-11-29_kloxo-redhat-centos","layout":"post","jdate":"Fri Nov 29 2013 00:00:00 GMT+0000","title":"نصب Kloxo در CentOS و ردهت","categories":["آموزشی"],"tags":["ردهت","centos","سرور"],"featured":"kloxo-logo.png","keywords":["kloxo","کنترل پنل کلکسو"],"description":"آموزش نصب Kloxo در CentOS و ردهت","timeToRead":5,"content":"\nمدیران سرورهای لینوکس غیر از انتخاب یک توزیع مناسب برای راه‌اندازی سرور خود، باید از یک کنترل پنل مناسب برای مدیریت بهتر سرور استفاده کنند. مخصوصا کسانی که نیاز به مدیریت دامنه‌های زیادی دارند، از راه دور سرور خود را مدیریت می‌کنند و اصلی‌ترین استفاده آن که برای مدیریت سرورهای مخصوص میزبانی وب است.\n\nو اما کدام کنترل پنل؟!\n\nشاید بتوان گفت که در حال حاضر بهترین کنترل پنل سرورهای لینوکس سی پنل (cpanel) است که امکانات لازم را با رابط کاربری مناسب و در محیطی امن در اختیار ما می‌گذارد و بعد از آن می‌توان از کنترل پنل DirectAdmin نام برد.\n\nاما کنترل‌پنل‌هایی که در بالا ذکر شد نیاز به پرداخت هزینه ماهانه تقریبا زیادی دارند که شاید برای افرادی به صرفه نباشد. مانند کسانی که نیاز به مدیریت گسترده ندارند و چند سایت یا چند سرویس مشخص را روی سرور خود دارند و یا امکان پرداخت هزینه را ندارند.\n\n![](/images/Kloxo6.1.0-high.png)\n\nدر این پست قصد دارم کنترل پنل رایگان کلکسو (Kloxo) را به شما معرفی کنم که برای مدیریت سرور و مخصوصا میزبان‌های وب مناسب است. این کنترل پنل محصول LxCenter است که از دیگر محصولات آن HyperVM است که برای مدیریت سرورهای مجازی شده استفاده می‌شود.\n\nشاید بتوان گفت که کلکسو یکی از بهترین کنترل پنل‌های رایگان است که بسیار به کاربران پیشنهاد می‌شود و امکانات، رابط کاربری و امنیت نسبتا خوبی را دارد. کلکسو آمده است که یک کنترل پنل رایگان و مناسب را برای مدیریت میزبان وب شما در اختیارتان قرار دهد که این مساله در بیشتر کنترل پنل‌های رایگان وجود ندارد و امکانات کمی برای مدیریت میزبانی وب دارند و بیشتر می‌توانید چند سایت (مخصوص سرورهای شخصی) را مدیریت کنید.\n\nبرای آشنایی با امکانات کلکسو می‌توانید دمو آن را از این آدرس مشاهده کنید. demo.kloxo.com:7778\n\nاکنون برویم سراغ آموزش نصب کلکسو. (منبع wiki.lxcenter.org/Kloxo+Installation+Guide)\n\n**پیش‌نیازها**\n\n1.  سرور خصوصی یا مجازی با سیستم‌عامل CentOS حداکثر نسخه 5 و یا >Red Hat EL. هنوز سنت-او-اس ۶ پشتیبانی نمی‌شود.\n2.  حداقل ۲۵۶ مگابایت رم (برای اجرای Yum کافی باشد). [البته تجربه شخصی من نشان می‌دهد حداقل باید ۵۱۲ مگابایت رم داشته باشید و برای استفاده مناسب ۱ گیگ رم پیشنهاد می‌شود.]\n3.  مقدار ۲ گیگ فضا دیسک برای نصب کلکسو و سرویس‌ها.\n4.  اگر به صورت دستی دیسک خود را پارتیشن‌بندی کرده‌اید مطمئن شوید شاخه /tmp بزرگی دارید. کلکسو از این شاخه برای ذخیره بک‌آپ استفاده می‌کند و اگر فضا آن کافی نباشد این عمل درست انجام نمی‌شود.\n\n**قبل از شروع**\n\nشما باید SELinux را غیرفعال کنید. برای این کار باید فایل `/etc/sysconfig/selinux` را باز کرده و خط مشخص را به این صورت تغییر دهید selinux=disabled. این تغییر SELinux را از شروع بعدی سیستم بعد از ریبوت فعال نگه می‌دارد و فقط برای این است که در سیشن فعلی که ما قصد داریم کلکسو را نصب کنیم بتوانیم آن را غیرفعال کنیم.\n\nبرای غیر فعال کردن SELinux در نشست جاری از دستورات زیر در خط فرمان استفاده کنید.\n\n```sh\nsu - rootsetenforce 0\n```\n\nاگر مطمئن نیستید که این عمل درست انجام شده برای چک کردن وضعیت از دستور _/usr/sbin/sestatus_ استفاده کنید.** عدم غیرفعال کردن صحیح SELinux باعث می‌شود نصب کلکسو بی‌فایده شود و راه‌اندازی مجدد سیستم‌عامل ممکن است نیاز به نصب درست دوباره آن داشته باشد.**\n\nهمچنین مطمئن شوید که پورت‌های 7777/tcp و 7778/tcp در فایروال سرور شما باز هستند. اگر این پورت‌ها بسته باشند شما نمی‌توانید به صفحه وب کنترل پنل کلکسو بعد از نصب آن دسترسی داشته باشید.\n\n**نصب کلکسو**\n\nنصب کلکسو نیاز به دریافت فایل kloxo-installer.sh از download.lxcenter.org و اجرای آن توسط کاربر روت دارد. این اسکریپ در طول اجرا برای نصب کلکسو از شما چند سوال می‌پرسد و گذرواژه‌ای درخواست می‌کند (رمز روت را وارد کنید).\n\n```sh\nsu - rootyum install -y wgetwget http://download.lxcenter.org/download/kloxo/production/kloxo-installer.sh\n```\n\nبعد از آن دستور زیر برای نصب به صورت مستر (تک سروری) وارد کنید.\n\n```sh\nsh ./kloxo-installer.sh --type=master\n```\n\nو اگر مستر نیستید از دستور زیر استفاده کنید.\n\n```sh\nsh ./kloxo-installer.sh --type=slave\n```\n\nاگر قبلا MySQL را روی سرور خود نصب کرده‌اید از دستورات زیر استفاده کنید.\n\n```sh\nsu - root\nyum install -y wget\nwget http://download.lxcenter.org/download/kloxo/production/kloxo-installer.sh\nsh ./kloxo-installer.sh --type=<master/slave> --db-rootpassword=PASSWORD\n```\n\nبعد از نصب کلکسو به آدرس http://YOUR_SERVER_IP:7778 متصل شوید (در مرورگر وارد کنید) و در صفحه ورود نام کاربری admin و پسورد پیش‌فرض که admin است را واد کنید. بعد از ورود کلکسو از شما می‌خواهد که برای امنیت بیشتر رمز پیش‌فرض را تغییر دهید.\n\n**بسته‌های نصب شده اولیه**\n\n*   سرویس‌های وب Web Services\n    *   آپاچی apache 2.x\n    *   پی‌اچ‌پی php 5.2.x\n    *   سرویس pure-ftpd برای مدیریت کاربران اف تی پی (ftp)\n    *   سرویس awstats برای تحلیل آمار وب (بازیدها، ترافیک و ...)\n\n*   سرویس‌های پست الکترونیک Mail Services\n    *   سرویس qmail-toaster\n    *   سرویس courier-imap-toaster\n    *   سرویس vpopmail\n    *   برنامه‌های وب میل Roundcube (به صورت اجکس) و Horde برای مدیریت پست‌های الکترونیک\n\n*   سرویس‌های نام‌دامنه DNS Services\n    *   سرویس bind برای پیاده سازی پروتکل DNS\n    *   سرویس bind-chroot برای BIND امن\n*   سرویس دیتابیس Database Service\n    *   برنامه mysql-server برای ساخت و مدیریت دیتابیس‌ها\n\n* شما می‌توانید بعد از نصب بین سرویس‌ها سوییچ کنید و یکی را انتخاب کنید. مانند؛  Apache/Lighttpd، BIND/djbdns، spamassassin/bogofilter و ... .\n\n**عیب‌یابی**\n\nاگر بعد از نصب نتوانستید به کنترل پنل کلکسو متصل شوید، مطمئن شوید که فایروال سرور پورت‌های ذکر شده را نبسته باشد. اگر این پورت‌ها بسته بود می‌توانید فایروال را با دستور /etc/init.d/iptables stop غیرفعال کنید و با انجام آن شاید بخواهید اسکریپ فایروالی برای کاربران خود بسازید تا امنیت خود را حفظ کنید. برای این کار می‌توانید از آموزش آخر مطلب استفاده کنید.\n\nبا همه این موارد اگر نتوانستید به پنل دسترسی داشته باشید و یا هر مشکل دیگری داشتید می‌توانید در انجمن کلکسو با آدرس forum.lxcenter.org مطرح کنید تا پاسخ بگیرید (محتوای فایل /root/kloxo-install/kloxo-linux/kloxo_install.log را برای راهنمایی بهتر به سوال خود پیوست کنید).\n\n**ملاحظات نهایی**\n\nط\n\n**ساخت اسکریپ فایروال برای کاربران خود - چگونه کلکسو را با جدول آی‌پی ایمن کنیم**\n\nط"}},"__N_SSG":true}