{"pageProps":{"page":{"slug":"2013-11-05_desktop-customization-tweak-tool","layout":"post","jdate":"Tue Nov 05 2013 00:00:00 GMT+0000","user":"misam","title":"شخصی‌سازی میزکار اوبونتو با Tweak Tool","categories":["آموزشی"],"tags":["اوبونتو","شخصی‌سازی"],"featured":"unity-tweak-tool.png","keywords":["tweak tool","شخصی‌سازی اوبونتو"],"description":"آموزش شخصی‌سازی میزکار اوبونتو با Tweak Tool","timeToRead":5,"content":"\nبرای شخصی‌سازی میزکار ابونتو مانند تمامی میزکارهای لینوکس روش معمول و اصلی تغییر در فایل‌های مورد نیاز و دستورات شل در ترمینال است اما در اینجا می‌خواهم برنامه‌ای را معرفی کنم که بسیاری از تغییرات را به راحتی و با چند کلیک ساده با رابط کاربری مناسب مهیا می‌کند.\n\n![](/images/unity-tweak-tool-screenshot.png)\n\nبرنامه Unity Tweak Tool یکی از برنامه‌های Tweak Tool است که برای میزکار  یونیتی (Unity) بهینه شده است و تقریبا تمامی امکانات مورد نیاز برای انجام هرگونه تغییر را فراهم می‌کند.\n\n![](/images/tweak-tool-screenshot.jpg)\n\nاز برنامه Tweak Tool هم می‌توان در محیط یونیتی استفاده کرد اما تغییرات کمتری را پشتیبانی می‌کند و برای میزکار گنوم (Gnome) مناسب است.\n\nاین برنامه را می‌توانید به راحتی در مرکز برنامه ابونتو (Ubuntu Software Center) جستجو و نصب کنید (برنامه Ubuntu Software Center به صورت پیش‌فرض در ابونتو قرار دارد و برای جست‌وجو و نصب نرم‌افزارهای ابونتو استفاده می‌شود).\n\nدر زیر لیستی از امکانات این برنامه را مشاهده می‌کنید.\n\n*   تغییر پوسته میزکار ابونتو (Theme)\n    *   می‌توانید پوسته‌ها را از اینترنت دریافت کرده و  در پوشه <span dir=\"ltr\">.themes</span> موجود در شاخه کاربری خود قرار دهید تا در برنامه قابل انتخاب باشد. این پوشه مخفی است و باید از میان‌برهای Ctrl + H برای نمایش فایل‌های مخفی در مرورگر استفاده کرد.\n\n*   تغییر آیکن های میزکار ابونتو (Icons<) - مانند پوسته در شاخه <span dir=\"ltr\">.icons</span> قرار دارد.\n*   تغییر اشاره گر موس ابونتو (Cursor)\n*   تغییر فونت و اندازه فونت نوشته ها و عنوان پنجره ها در ابونتو\n*   تغییر جهت دکمه های کنترلی (بستن، کوچک و بزرگ کردن) از چپ به راست یا برعکس\n*   اضافه کردن آیکن‌های پوشه خانه مرورگر فایل (Home Folder)، سطل بازیافت (Trash) و شبکه و درایوها به میزکار\n*   محافظت از میزکار با غیر فعال کردن امکان عکس برداری میزکار، قفل کردن آن و تعویض کاربری\n*   تغییر حالت امکان اسکرول کردن صفحات\n*   پنهان سازی خودکار لانچر (با نام Launcher و نوار کناری است)\n*   کنترل نوع انیمیشن لانچر\n*   کنترل مکان برای نمایش لانچر\n*   تغییر سنسور نمایش لانچر\n*   تغییر شفافیت لانچر\n*   تغییر رنگ لانچر یا تنظیم رنگ بر اساس تصویر پس زمینه\n*   تغییر اندازه آیکن های موجود در لانچر\n*   نمایش یا عدم نمایش آیکن «نمایش میزکار» (Show Desktop) در لانچر\n*   تغییر پس زمینه آیکن های لانچر\n*   تغییر انیمیشن حالت های مختلف آیکن های لانچر\n*   کدر بودن (Blur) یا نبودن بخش جستجو\n*   تعیین نوع کدر بودن بخش جستجو\n*   نمایش یا عدم نمایش پیشنهادهای بیشتر (More Suggestions) در بخش جستجو\n*   نمایش یا عدم نمایش تازه استفاده شده (Recently Used) در بخش جستجو\n*   فعال سازی یا غیر فعال کردن امکان جستجو در فایل ها در بخش جستجو\n*   پاک کردن تاریخچه (History) دستورات\n*   تغییر شفافیت نوار بالایی (که شامل ساعت و باطری و ... است)\n*   نمایش یا عدم نمایش تاریخ و ساعت در نوار بالایی ابونتو\n*   تغییر نوع نمایش ساعت به ۱۲ ساعته یا ۲۴ ساعته\n*   شامل کردن ثانیه، تاریخ، روز هفته و تقویم به ساعت\n*   نمایش یا عدم نمایش وضعیت باطری و انرژی یا نمایش وقتی که به برق متصل نیست\n*   نمایش نام کاربری در نوار بالایی ابونتو\n*   نمایش یا عدم نمایش آیکن بولوتوث در نوار بالایی\n*   تنظیمات مربوط به جابجایی بین میزکارها (Workspaces Switching)\n*   تنظیمات وب اپلیکیشن ها (Web Apps)\n*   تنظیمات پنچره ها\n*   خاموش یا روشن کردن چند امکان چند میزکاری (Workspaces)\n*   تغییر تعداد میزکارها (بیشتر یا کمتر از ۴ میزکار معمول)\n*   تغییر میان بر جابجایی بین میزکارها\n*   تنظیمات مربوط به Window Snapping\n*   تنظیمات Hotcorners"}},"__N_SSG":true}