{"pageProps":{"page":{"slug":"2013-10-14_ubuntu-page-customization","layout":"post","jdate":"Mon Oct 14 2013 00:00:00 GMT+0000","user":"misam","title":"شخصی سازی صفحه ورود ابونتو","categories":["آموزشی"],"tags":["شخصی‌سازی","اوبونتو"],"featured":"ubuntu-login_screen.png","keywords":["شخصی‌سازی اوبونتو","ubuntu custom","حذف کاربر مهمان اوبونتو","remove ubuntu guest user"],"description":"شخصی سازی صفحه ورود ابونتو و حذف کاربر مهمان","timeToRead":5,"content":"\nبسیار پیش آمده که بخواهید تغییراتی در صفحه ورود ابونتو (Login Screen) خود ایجاد کنید؛ مثلاً بخواهید گزینه ورود مهمان (Guest) را حذف کنید و جلوی ورود با این گزینه به سیستم خود را بگیرید و یا بخواهید با کاربری روت وارد شوید. همگی این اعمال با تغییرات در یک فایل متنی که می‌خواهم معرفی کنم قابل انجام است.\n\n![](/images/ubuntu-login_screen.png)\n\nفایلی که ما با آن سروکار داریم lightdm.conf است که در آدرس /etc/lightdm قرار دارد. برای تغییر محتوای این فایل نیاز به دسترسی روت داریم پس از دستور زیر در ترمینال برای باز کردن و شروع ویرایش آن استفاده می‌کنیم.\n\n```sh\nsudo gedit /etc/lightdm/lightdm.conf\n```\n\nبرای نمونه دو مورد از تغییراتی که می‌توان اعمال کرد را در اینجا شرح می‌دهم.\n\nتوجه: از ابونتو ۱۳.۱۰ فایلی که باید محتوای آن را تغییر دهید در مسیر `/etc/lightdm/lightdm.conf.d/50-unity-greeter.conf` قرار دارد نه مسیر بالا.\n\n### اضافه کردن امکان ورود دستی با استفاده از نام کاربری و رمز عبور\n\nدر حالت عادی در صفحه ورود ابونتو لیستی از نام‌های کاربری وجود دارد که با اشاره به آن‌ها و دادن رمز هر کدام با آن نام کاربری وارد محیط سیستم عامل می‌شوید اما شاید بخواهید به صورت دستی نام کاربری و رمز را بدهید. این عمل بیشتر برای مواردی استفاده می‌شود که می‌خواهیم با کاربر روت وارد سیستم بشویم. اگر چه این عمل توصیه نمی‌شود و شما هر کاری که می‌خواهید در حالت روت انجام دهید کافیست با کاربری خود وارد شوید و در ترمینال با دستور sudo‌ آن دستور را اجرا کنید (بعد از اجرای این دستور رمز کاربر ادمین از شما پرسیده می‌شود). اما در هر صورت برای اضافه کردن این قابلیت به صفحه ورود خود این کد را در خط جداگانه‌ای به محتوای متن فایل اضافه کنید.\n\n```\ngreeter-show-manual-login=true\n```\n\n### حذف گزینه ورود با کاربر مهمان\n\nبا این‌که ابونتو برای کاربران مهمان جلسه (session) جدید ایجاد می‌کند و دسترسی آن‌ها را به منابع شما کنترل می‌کند تا کسی از اطلاعات شما سوء استفاده نکند و به شما اطمینان می‌دهد که این قابلیت مشکلی در امنیت شما ایجاد نمی‌کند؛ اما برخی کاربران دوست ندارند کاربران ناخواسته از سیستم آن‌ها استفاده کنند. برای اضافه کردن این قابلیت کد زیر را در خط جداگانه‌ای به محتوای متن فایل اضافه کنید.\n\n```\nallow-guest=false\n```"}},"__N_SSG":true}