{"pageProps":{"page":{"slug":"2014-07-15_linux-automatic-mount","layout":"post","jdate":"Tue Jul 15 2014 00:00:00 GMT+0000","user":"saaie","title":"mount کردن خودکار پارتیشن‌های لینوکس","categories":["آموزشی"],"tags":["پیکربندی"],"featured":"mount.gif","keywords":["mount","mount خودکار","مانت خودکار","پارتیشن بندی لینوکس"],"description":"آموزش mount کردن خودکار پارتیشن‌های لینوکس","timeToRead":5,"content":"\nشاید با این مشکل روبرو شدید که پارتیشن‌های هاردتون رو به عنوان دستگاه جداشدنی (removable device) مثل فلش می‌شناسه و باید پارتیشن‌ها رو mount کنیم تا بتونیم استفاده کنیم. حالا ببینیم mount کردن یعنی چی:\n\n*   mount کردن یعنی اینکه به سیستم عامل اعلام کنیم که پارتیشن برای خواندن، نوشتن و یا خواندن و نوشتن آماده است.\n\nبرای اینکه همزمان با بوت شدن لینوکس پارتیشن‌ها mount بشن باید با چند مفهوم آشنا بشیم.\n\n*   [نام گذاری هارد دیسک و پارتیشن‌ها](http://linuxihaa.ir/%d8%a2%d8%b4%d9%86%d8%a7%db%8c%db%8c-%d8%a8%d8%a7-%d9%86%d8%a7%d9%85%e2%80%8c%da%af%d8%b0%d8%a7%d8%b1%db%8c-%d8%af%db%8c%d8%b3%da%a9%e2%80%8c%d9%87%d8%a7-%d8%af%d8%b1%d9%84%db%8c%d9%86%d9%88%da%a9/) که در مطلبی با همین نام در لینوکسی‌ها منتشر شده\n*   mount point: لینوکس برای مخفی کردن جزییات خواندن و نوشتن بر روی هارد دیسک امکان عمل mount را بر روی یک دایرکتوری خالی ایجاد  کرده است و پس از mount کردن یک پارتیشن بر روی یک دایرکتوری، لینوکس آماده خواندن و نوشتن بر روی آن است و برای ما با داریکتوری‌های دیگر هیچ تفاوتی ندارد و انگار با دایرکتوری‌های معمول کار می‌کنیم. نکته اینجاست که همه پارتیشن‌ها در زیر شاخه‌ای از پارتیشن اصلی ،که بر روی آن لینوکس نصب شده و در آدرس **/ **mount شده است، mount می‌شود.\n*   نوع سیستم فایل: سیستم فایل معمول لینوکس ext4 است اما سیستم فایل‌هایی مثل ntfs و fat و غیره نیز وجود دارند.\n*   **etc/fstab/ **این فایل در زمان بوت لینوکس خوانده می‌شود و تمامی سیستم فایل‌هایی که در این فایل آورده شده‌اند mount می‌شوند.\n\nخب حالا برای مشاهده لیست پارتیشن‌ها از دستور زیر استفاده کنید:\n\n```sh\n$ sudo fdisk -l\n```\n\nبعد باید با یک ویرایشگر متن مثل gedit فایل `etc/fstab/` رو باز کنید:\n\n```sh\n$ sudo gedit /etc/fstab\n```\n\n## ساختار فایل etc/fstab/\n\n*   ستون اول <file system>: در این ستون باید پارتیشن مورد نظر که می‌خواهید خودکار mount شود را می‌نویسید.\n*   ستون دوم  <mount point>: ابتدا یک دایرکتوری برای mount کردن پارتیشن ایجاد کنید و آدرس آن را در این ستون بنویسید.\n*   ستون سوم <type>: نوع سیستم فایل را در این ستون بنویسید. اگر نمی‌دانید که نوع سیستم فایل شما چیست و یا ntfs است در این قسمت auto بنویسید که خودش تشخیص دهد.\n*   ستون چهارم <options>: در این ستون دسترسی‌ها و تنظیمات دیگر را می‌توان تعیین کرد اما اگر نمی‌دانید چه چیزی بنویسید defaults بنویسید که خود دیسترو تصمیم بگیرد.\n*   ستون پنجم <dump>: در این ستون برای تصمیم در مورد زمانی که سیستم فایل مشکل پیدا می‌کند از آن backup بگیرد یا خیر. اگر نمی‌دانید چه مقداری بنویسید این قسمت را عدد صفر بنویسید.\n*   ستون ششم <pass>: در این ستون اگر عدد صفر بنویسید در زمان بوت سیستم فایل را چک نمی‌کند و اگر عدد دو را بنویسید در زمان بوت چک می‌کند.\n\n* بین تمامی ستون‌های فوق را با tab یا space جدا کنید."}},"__N_SSG":true}