{"pageProps":{"page":{"slug":"2014-02-03_install-arch-linux","layout":"post","jdate":"Mon Feb 03 2014 00:00:00 GMT+0000","user":"misam","title":"آموزش نصب آرچ لینوکس","categories":["آموزشی"],"tags":["آرچ‌لینوکس"],"featured":"arch_linux.jpg","keywords":["نصب آرچ لینوکس","arch linux installation"],"description":"آموزش نصب آرچ لینوکس","timeToRead":5,"content":"\nهمان‌طور که در مطلب [توزیع آرچ لینوکس](http://linuxihaa.ir/%D8%AA%D9%88%D8%B2%DB%8C%D8%B9-%D8%A2%D8%B1%DA%86-%D9%84%DB%8C%D9%86%D9%88%DA%A9%D8%B3/) مطالعه کردید، توزیع آرچ با هدف سادگی و سبکی آمده است و از این رو به‌صورت پیش‌فرض فرایند نصبی برای آن در نظر گرفته نشده است و اشاره کردیم که آموزش عملیات نصب در آن به صورت کلی و سربسته به صورت فایل متنی قرار داده شده است؛ اما اکنون می‌خواهم فرایند نصب این توزیع را به صورت ساده آموزش بدهم تا کاربرانی که علاقه‌مند به سرعت و سبکی این توزیع هستند بتوانند به‌راحتی از آن استفاده کنند.\n\nقبل از آموزش مراحل نصب دو توزیع آرچ بنگ ([archbang](http://archbang.org/)) و انترگوس ([Antergos](http://antergos.com/)) را به شما معرفی می‌کنم که نصب آرچ لینوکس را برای کاربران راحت کرده‌اند.\n\nآرچ بنگ یک توزیع بر پایه آرچ با مدیر پنجره و میزکار اوپن باکس (Openbox) است که فرایند نصب ساده‌ای را در اختیار شما می‌گذارد.\n\nانترگوس نیز یک توزیع دوست داشتنی بر پایه آرچ است که گزینه‌های نصب پایه، همراه با میزکار سینامون، گنوم، اوپن‌باکس و ... را برای شما محیا می‌کند تا به هر صورت که می‌خواهید و به راحتی هرچه تمام آرچ لینوکس را نصب کند.\n\nاما برویم سر مطلب اصلی خودمان یعنی، آموزش نصب آرچ لینوکس و نه نصب با دیگر توزیع‌ها. این کار ممکن است در نگاه اول سخت به نظر بیاید اما این‌طور نیست و با آموزشی که در ادامه مطالعه می‌کنید بسیار راحت است. همچنین مراحل نصب برای دوست‌داران خط فرمان (بهتر بگویم دوست داران دانستن و به نوعی شاید گیگ ها) بسیار جالب است.\n\nشروع کنیم.\n\nابتدا آخرین نسخه آرچ لینوکس را از آدرس archlinux.org/download دریافت کنید و دیسک یا فلش قابل بوت خود را آماده کنید.\n\nسپس آرچ را توسط دیسک یا فلش بالا بیاورید و در صفحه‌ای که به شکل زیر می‌بینید یکی از موارد x86_64 و یا i686 را انتخاب کنید و منتظر بمانید تا خط فرمان برای شما آماده شود و بعد از آن مراحل نصب را دنبال کنید.\n\n![](/images/arch-bootloader.png)\n\n## مرحله اول - پارتیشن بندی هارد دیسک در لینوکس\n\nابتدا دستور زیر را وارد کرده تا از آدرس هارد دیسک خود در میان دستگاه‌های متصل مطلع شوید.\n\n```sh\nlsblk\n```\n\nدر خروجی شما `/dev/sda` را خواهید دید. اکنون برنامه پارتیشن بندی در خط فرمان را با آدرس هارد دیسک را وارد کنید.\n\n```sh\ncgdisk /dev/sda\n```\n\nاکنون صفحه‌ای مانند تصویر زیر را مشاهده خواهید کرد.\n\n![](/images/cgdisk.jpg)\n\n### ایجاد پارتیشن بوت در لینوکس با برنامه cgdisk\n\nروی گزینه New رفته و مقادیر زیر را در سوالات وارد کنید.\n\n1.  Hit New » چیزی وارد نکنید و اینتر بزنید\n2.  First Sector » چیزی وارد نکنید و اینتر بزنید\n3.  Size in Sector » مقدار 1007KiB را وارد کنید و اینتر بزنید\n4.  Hex Code of GUID (L to show codes, Enter = 8300) » مقدار ef02 را وارد کنید و اینتر بزنید\n5.  Enter partition name » چیزی وارد نکنید و اینتر بزنید\n\nاکنون صفحه‌ای مانند تصویر زیر را مشاهده خواهید کرد.\n\n![](/images/cgdisk-bios-partition.jpg)\n\n### ایجاد پارتیشن روت در لینوکس با برنامه cgdisk\n\nمانند بالا عمل کنید فقط در بخش سوم فضای مورد نیازتان برای روت لینوکس مثلا 20GB را وارد کنید و در بخش چهارم نیز چیزی وارد نکنید.\n\n### ایجاد پارتیشن swap در لینوکس با برنامه cgdisk\n\nبخش سواپ در لینوکس برای کمک به حافظه اصلی قرار گرفته است. شما می‌توانید بسته به اندازه رم خود مقدار فضای سواپ مناسب را بسازید. برای این کار مانند مراحل بالا عمل کنید فقط در بخش سوم فضای سواپ مورد نیاز مثلا 2GB را وارد کنید. در بخش چهارم نیز مانند روت چیزی وارد نکنید و در بخش پنجم کلمه swap را وارد کنید.\n\n### ایجاد پارتیشن home در لینوکس با برنامه cgdisk\n\nمانند ساخت پارتیشن روت عمل کنید فقط در بخش سوم فضای مورد نیازتان برای هوم دایرکتوری لینوکس مثلا 50GB را وارد کنید.\n\nدر آخر باید صفحه‌ای مانند تصویر زیر را مشاهده کنید.\n\n![](/images/cgdisk-complete-partitions.jpg)\n\nسپس گزینه Write را زده و با وارد کردن yes عمل پارتیشن بندی را کامل کنید و بعد با گزینه Quit از برنامه خارج شوید.\n\nاکنون باز هم دستور `lsblk` را در خط فرمان وارد کنید. اگر پارتیشن بندی درست انجام شده باشد خروجی شبیه به تصویر زیر خواهید داشت.\n\n![](/images/lsblk-arch-linux.jpg)\n\n## مرحله دوم - ساخت فایل سیستم در لینوکس (فرمت کردن پارتیشن ها در لینوکس)\n\nدستورات زیر را وارد کنید تا پارتیشن‌های ۲ و ۴ با فرمت ext4 فرمت شوند.\n\n```sh\nmkfs.ext4 /dev/sda2\nmkfs.ext4 /dev/sda4\n```\n\nسپس دستور زیر را برای ساخت فرمت swap در پارتیشن ۳ وارد کنید.\n\n```sh\nmkswap /dev/sda3\n```\n\nاکنون پارتیشن سواپ را فعال کنید\n\n```sh\nswapon /dev/sda3\n```\n\nاین مرحله هم تمام شد.\n\n## مرحله سوم - اتصال و استفاده از هارد دیسک پارتیشن بندی شده\n\nابتدا پارتیشن روت را مانت کنید.\n\n```sh\nmount /dev/sda2 /mnt\n```\n\nسپس شاخه هوم را ساخته و پارتیشن هوم را نیز روی آن مانت کنید.\n\n```sh\nmkdir /mnt/home\nmount /dev/sda4 /mnt/home\n```\n\n## مرحله چهارم - انتخاب mirror مناسب در آرچ لینوکس\n\nدستور زیر را وارد کنید و از لیست میرورها، میرور مناسب را انتخاب کرده، به اول خط آن رفته، کلید Alt + 6 را فشرده سپس به بالای لیست بروید و کلید Ctrl + U را بزنید تا متن آدرس سرور چسبانده شود. سپس کلید Ctrl + X را فشرده و با وارد کردن کلید Y خارج شوید.\n\n```sh\nnano /etc/pacman.d/mirrorlist\n```\n\n## مرحله پنجم - نصب بسته های اولیه آرچ لینوکس\n\nابتدا بهتر است با دستور زیر از اتصال درست به اینترنت مطمئن شوید.\n\n```sh\nping -c 4 linuxihaa.ir\n```\n\nسپس دستور زیر را وارد کرده و تا کامل شدن دانلود و نصب بسته‌ها که چیزی حدود ۱۵۰ مگابایت است صبر کنید.\n\n```sh\npacstrap -i /mnt base base-devel\n```\n\n## مرحله ششم - کانفیگ fstab در آرچ لینوکس\n\nبا دستور زیر fstab را کانفیگ کنید تا مشخصات نصب در سیستم شما کانفیگ شود.\n\n```sh\ngenfstab -U -p /mnt >> /mnt/etc/fstab\n```\n\nبرای مشاهده صحت پارتیشن بندی، نصب اولیه آرچ و کانفیگ دستور زیر را وارد کنید. برای خروج نیز مانند بخش انتخاب میرور عمل کنید.\n\n```sh\nnano /mnt/etc/fstab\n```\n\n## مرحله ششم - وارد شدن به لینوکس نصب شده روی هارد دیسک\n\nبا دستور زیر وارد لینوکسی که نصب کرده‌اید بشوید تا آن را کانفیگ کنید.\n\n```sh\narch-chroot /mnt\n```\n\n## مرحله هفتم - تنظیم زبان و لوکیشن در آرچ لینوکس\n\nدستور زیر را وارد کنید تا لیست زبان ها را مشاهده کنید و یکی از آن‌ها مثلا en_US.UTF-8 UTF-8 را انتخاب کرده و کامنت اول آن را بردارید و از ویراشگر nano خارج شوید و در هنگام خروج تغییرات را ذخیره کنید.\n\n```sh\nnano /etc/locale.gen\n```\n\nسپس دستورات زیر را وارد کنید.\n\n```sh\nlocale-gen\necho LANG=en_US.UTF-8 > /etc/locale.conf\nexport LANG=en_US.UTF-8\n```\n\n### تنظیم Time zone در آرچ لینوکس\n\nدستور زیر را وارد کنید تا محل مورد نظر خود را از لیست موجود بیابید.\n\n```sh\nls /usr/share/zoneinfo/\n```\n\nسپس از دستور زیر برای تنظیم تایم زون استفاده کنید. توجه کنید که این بخش را بسته به محل خودتان تنظیم کنید.\n\n```sh\nln -s /usr/share/zoneinfo/<Zone>/<SubZone> /etc/localtime\n```\n\nمثلا من تهران، آسیا را انتخاب کردم از دستور زیر استفاده کردم.\n\n```sh\nln -s /usr/share/zoneinfo/Asia/Tehran> /etc/localtime\n```\n\nسپس دستور زیر را برای تنظیم ساعت سیستم وارد کنید. در اینجا من UTC را انتخاب کردم.\n\n```sh\nhwclock --systohc --utc\n```\n\n## مرحله هشتم - تنظیم نام کامپیوتر در آرچ لینوکس\n\nدر این مرحله نام هاست خود را ست می‌کنیم. مثلا من linuxihaa را با دستور زیر انتخاب کرده‌ام.\n\n```sh\necho muktware > /etc/hostname\n```\n\n## مرحله نهم - کانفیگ و تنظیمات مخازن در آرچ لینوکس\n\nدستور زیر را وارد کنید وارد کنید.\n\n```sh\nnano /etc/pacman.conf\n```\n\nو اگر از نسخه ۶۴ بیت استفاده می‌کنید کامنت منابع مالتی لیب که متن آن مانند زیر است را بردارید و از ویراشگر خارج شده و تغییرات را ذخیره کنید.\n\n```\n[multilib]\nInclude = /etc/pacman.d/mirrorlist\n```\n\nسپس با دستور زیر منابع را به روز کنید.\n\n```sh\npacman -Sy\n```\n\n## مرحله دهم - ساخت کاربر در آرچ لینوکس\n\nابتدا با دستور زیر رمز مناسبی برای کاربری روت خود تنظیم کنید.\n\n```sh\npasswd\n```\n\nسپس کاربری مانند linuxihaa و یا هر نام دیگری که می‌خواهید را با دستور زیر به آرچ لینوکس اضافه کنید (دستور زیر کاربر شما را در گروه wheel نیز قرار می‌دهد).\n\n```sh\nuseradd -m -g users -G wheel,storage,power -s /bin/bash linuxihaa\n```\n\nبعد از آن با دستور `passwd linuxihaa` گذرواژه مناسب را برای کاربر خود انتخاب کنید.\n\n## مرحله یازدهم - نصب و تنظیمات sudo در آرچ لینوکس\n\nابتدا با دستورات زیر برنامه sudo را به صورت کامل نصب کنید.\n\n```sh\npacman -S sudo\npacman -Ss sudo\n```\n\n### اجازه دادن به کاربران گروه wheel برای اجرای sudo در آرچ لینوکس\n\nدستور زیر را وارد کرده و کامنت خط حاوی `%wheel ALL=(ALL) ALL` را بردارید و از ویرایشگر خارج شده و تغییرات را ذخیره کنید.\n\n```sh\nEDITOR=nano visudo\n```\n\n## مرحله دوازدهم - نصب و bash-completion برای کامل کردن اتوماتیک نام دستورات بسته ها\n\nدستور زیر را اجرا کنید.\n\n```sh\npacman -S bash-completion\n```\n\n## مرحله سیزدهم - نصب بوت لودر Grub روی ارچ لینوکس\n\nابتدا دستور زیر را برای نصب بسته بوت لودر گراب وارد کنید.\n\n```sh\npacman -S grub\n```\n\nاکنون گراب را روی هارد دیسک خود نصب کنید.\n\n```sh\ngrub-install --target=i386-pc --recheck /dev/sda\n```\n\nبرای کانفیگ گراب و اضافه کردن دیگر سیستم عامل های نصب شده روی سیستم خود به منوی گراب دستور زیر را وارد کنید.\n\n```sh\ngrub-mkconfig -o /boot/grub/grub.cfg\n```\n\n## مرحله پایانی\n\nاز لینوکس نصب شده خارج شوید.\n\n```sh\nexit\n```\n\nسپس پارتیشن روت را از مانت خارج کنید.\n\n```sh\numount -R /mnt\n```\n\nو در آخر سیستم را دوباره راه اندازی کنید.\n\n```sh\nreboot\n```\n\nتبریک! تمام شد و بعد از بالا آمدن گراب می‌توانید وارد آرچ لینوکس نصب شده خود شوید.\n\nبه زودی آموزش نصب محیط گرافیکی شامل میزکار در آرچ لینوکس را هم در همین سایت خواهم گذاشت. موفق باشید.\n\n* منبع goo.gl/HTpax1"}},"__N_SSG":true}