{"pageProps":{"page":{"slug":"2014-06-27_wifi-hotspot-linux","layout":"post","jdate":"Fri Jun 27 2014 00:00:00 GMT+0000","user":"misam","title":"WiFi Hotspot در لینوکس","categories":["آموزشی"],"tags":["اوبونتو","شبکه"],"featured":"ap-hotspot.png","keywords":["WiFi Hotspot"],"description":"آموزش هات هات اسپات کردن وای فا در لینوکس","timeToRead":5,"content":"\nامروزه کاربران نیاز دارند تا به‌راحتی، هر جای محل کار یا خانه هستند با دستگاه‌های مختلف به اینترنت متصل شوند.\n\nنیاز به اشتراک اینترنت در محیط خانه یا محل کار به‌صورت بی‌سیم، اغلب سبب می‌شود تا کاربران رو به مودم‌های بی‌سیم بیاورند. اما کاربرانی که مودم سیمی دارند چگونه این مشکل را حل کنند؟! آیا راهی جز خرید مودم بی‌سیم برای اشتراک اینترنت وجود دارد؟!\n\nشاید بیشتر با وای فای هات اسپات (WiFi Hotspot) در سیستم‌عامل اندروید آشنا هستید؛ ویژگی‌ای که امکان اشتراک اینترنت دستگاه اندرویدی را برای کاربران فراهم می‌کند و کاربران را از شر ارتباط بلوتوثی یا کابلی (در سیستم‌عامل‌هایی مانند سیمبیان نوکیا) خلاص می‌کند.\n\nباید بگویم که این ویژگی کاملا به WiFi دستگاه شما بستگی دارد و چیزی جدای آن نیست. یعنی کافیست تا هر دستگاهی که دارید WiFi داشته باشد؛ در این صورت با اضافه کردن ویژگی‌های نرم‌افزاری می‌توان آن را Hotspot کرد.\n\nدر هر سیستم‌عامل برای ایجاد یک اتصال Hotspot تدابیری اندیشیده شده است اما برای این‌که انجام این عملیات راحت‌تر شود و اینترنت نیز در این هات اسپات به اشتراک گذاشته شود (چون می‌توان فقط یک شبکه محلی با Hotspot ایجاد کرد)، برنامه‌هایی وجود دارند که به راحتی این کار را برای شما انجام می‌دهند.\n\nدر سیستم‌عامل اندروید در بخش تنظیمات این ویژگی بدون نیاز به نصب برنامه اضافی قابل دسترس است. در سیستم‌عامل ویندوز نیز اغلب از برنامه‌هایی مانند PublicMyWiFi و Connectify استفاده می‌شود. اما در لینوکس چه می‌شود؟! تکلیف کاربران لینوکس چیست؟!\n\nدر اینجا برنامه ap-hotspot را به شما معرفی می‌کنم که یک اسکریپت بش است و به راحتی یک وایفا هات اسپات در سیستم لینوکس شما ایجاد می‌کند.\n\nبرای نصب این برنامه در اوبونتو از دستورات زیر در ترمینال استفاده کنید (دیگر توزیع‌ها می‌توانند اسکریپت آن را از [اینجا](https://github.com/hotice/AP-Hotspot) دریافت کنند).\n\n```sh\nsudo add-apt-repository ppa:nilarimogard/webupd8\nsudo apt-get update\nsudo apt-get install ap-hotspot\n```\n\nاکنون می‌توانید با دستور زیر هات اسپات خود را پیکربندی کنید. تنظیماتی شامل نام هات اسپات، پسورد و کارت‌های شبکه.\n\n```sh\nsudo ap-hotspot configure\n```\n\nبعد از ایجاد پیکربندی دلخواه و مناسب، با دستور زیر آن را فعال کنید.\n\n```sh\nsudo ap-hotspot start\n```\n\nاگر هنگام فعال شدن منتظر ماند، دستور بالا را با Ctrl + C خاتمه دهید و سپس از دستورات زیر استفاده کنید.\n\n```sh\nsudo rm /tmp/hotspot.pid\nsudo nmcli nm wifi off\nsudo rfkill unblock wlan\n```\n\nبرای غیر فعال کردن نیز از سوییچ stop استفاده کنید.\n\nتوجه کنید که برای عدم تداخل، راحت‌ترین کار این است که کارت شبکه ورودی (اینترنت را به سیستم می‌دهد) با کارت شبکه خروجی (اینترنت را از طریق آن به اشتراک می‌گذارد) متفاوت باشد. مثلا کامپیوتر خود را با کابل شبکه به اینترنت متصل کنید و کارت شبکه ورودی ethX می‌شود و از کارت شبکه وای‌فای wlanX فقط برای هات اسپات استفاده کنید. در غیر این صورت باید تنظیمات خاصی انجام دهید که  سعی می‌کنم در آموزش‌های بعدی قرار دهم. هچنین خودتان با جست‌وجو در اینترنت می‌توانید پیدا کنید."}},"__N_SSG":true}