{"pageProps":{"page":{"slug":"2014-07-15_linux-disk-naming","layout":"post","jdate":"Tue Jul 15 2014 00:00:00 GMT+0000","user":"saaie","title":"آشنایی با نام‌گذاری دیسک‌ها در لینوکس","categories":["آموزشی"],"tags":["پیکربندی"],"featured":"adding-a-hard-disk-1-1.jpg","keywords":["دیسک‌های لینوکس"],"description":"آشنایی با نام‌گذاری دیسک‌ها درلینوکس","timeToRead":5,"content":"\nهمان طور که قبلا در مورد [دایرکتوری‌های لینوکس](http://linuxihaa.ir/%d8%a2%d8%b4%d9%86%d8%a7%db%8c%db%8c-%d8%a8%d8%a7-%d8%af%d8%a7%db%8c%d8%b1%da%a9%d8%aa%d9%88%d8%b1%db%8c%e2%80%8c%d9%87%d8%a7%db%8c-%d9%84%db%8c%d9%86%d9%88%da%a9%d8%b3/) مطالبی را گفتیم، دایرکتوری **dev/ **مربوط به دستگاه‌هایی است که لینوکس تشخیص داده و برای هر دستگاه یک فایل در  **dev/ **در نظر می‌گیرد. دیسک و پارتیشن‌های روی آن نیز از این قاعده مستثنی نبوده و به ازای هر دیسک و هر پارتیشن یک فایل در **dev/ **وجود دارد. اما کدام فایل‌ها در **dev/ **مربوط به دیسک‌ها و پارتیشن‌ها هستند؟ برای پاسخ دادن به این سوال باید با نحوه نام‌گذاری دیسک‌ها در لینوکس آشنا شویم.\n\n*   فایل‌هایی مثل cdrom، dvd، sr0 یکسان هستند و مربوط به دستگاه dvd شما هستند.\n\nاما هارد دیسک به صورت زیر نام‌گذاری می‌شود:\n\n*   اگر هارد شما از نوع قدیمی (PATA) باشد، هاردهایی که به IDE معروفند با hd شروع می‌شوند و فرمت کلی آن‌ها hdXY است که X یک کاراکتر الفبایی است و از a شروع می‌شود و تا z می تواند ادامه یابد، X در واقع شماره هارد شماست. اگر یک هارد داشته باشید نام هارد شما hda می‌شود و اگر بیش‌از یک هارد داشته باشید هارد اول hda، هارد دوم hdb و الی آخر نام گذاری می‌شوند. Y شماره پارتیشن‌های هارد را مشخص می‌کند و از یک شروع می‌شود و ادامه پیدا می‌کند.\n*   اگر هارد شما از نوع SATA است نام گذاری با sd شروع می‌شود و فرمت کلی آن sdXY است که X مانند حالت قبل شماره دیسک و Y شماره پارتیشن‌های دیسک است(در ادامه نحوه نام گذاری پارتیشن‌ها آمده است).\n\nنام گذاری پارتیشن‌ها:\n\n*   همان طور که می‌دانید هر هارد دیسک به صورت سخت‌افزاری چهار پارتیشن را حداکثر می‌تواند پشتیبانی کند، اما شاید بیش از چهار پارتیشن نیز بر روی یک هارد دیده باشید، دلیل آن را بررسی می‌کنیم. حتما این را هم می‌دانید که دو نوع پارتیشن داریم primary و extended که این دو نوع توسط هارد دیسک به صورت سخت افزاری پشتیبانی می‌شود. بر روی پارتیشن‌های extended می‌توان به تعداد دلخواه به صورت نرم‌افزاری پارتیشن logical ساخت. با توضیحات ارایه شده در مورد پارتیشن‌ها به نام گذاری می‌پردازیم. پارتیشن‌های primary و extended می‌توانند اعداد یک تا چهار را به خود اختصاص دهند و پارتیشن‌های logical همیشه از پنج شروع می‌شوند و ادامه می‌یابند. نکته قابل توجه این است که حتی اگر تنها یک پارتیشن primary و یک پارتیشن extended داشته باشیم که دارای شماره یک و دو هستند باز هم logicalها از پنج شروع می‌شوند.\n\nدر زیر چند مثال برای واضح شدن مطلب بیان می‌کنیم:\n\n*   **dev/sda/ **نشان دهنده این است که هارد از نوع SATA بوده(sd) و هارد اول(a) ماست. اینکه شماره پارتیشن ندارد یعنی خود هارد است فارغ از پارتیشن‌هایش.\n*   **dev/hdb/ **نشان دهنده این است که هارد از نوع PATA بوده(hd) و هارد دوم(b) ماست. اینکه شماره پارتیشن ندارد یعنی خود هارد است فارغ از پارتیشن‌هایش.\n*   **dev/sdc3/ **نشان دهنده این است که هارد از نوع SATA بوده(sd) و هارد سوم(c) ماست. شماره 3 بیانگر این است که پارتیشن از نوع primary یا extended بوده و پارتیشن سوم ماست.\n*   **dev/hde6/ **نشان دهنده این است که هارد از نوع PATA بوده(hd) و هارد پنجم(e) ماست. شماره 6 بیانگر این است که پارتیشن از نوع logical بوده و دومین پارتیشن logical ماست."}},"__N_SSG":true}