{"pageProps":{"page":{"slug":"2014-05-12_setup-minimal-linux","layout":"post","jdate":"Mon May 12 2014 00:00:00 GMT+0000","user":"misam","title":"برپاسازی لینوکس پایه","categories":["آموزشی"],"tags":["پیکربندی","توسعه"],"featured":"gnu-linux.jpg","keywords":["برپاسازی لینوکس پایه","ساخت توزیع لینوکس"],"description":"آموزش برپاسازی لینوکس پایه و ساخت توزیع لینوکس شخصی","timeToRead":5,"content":"\nافرادی هستند که نیاز به برپاسازی یک لینوکس پایه دارند. از جمله نیاز افراد برای این کار می‌توان به استفاده از ابزارهای پایه لینوکس در سیستمی خلوت و کم حجم و یا حتی تولید توزیع جدید اشاره کرد.\n\nافرادی که می‌خواهند توزیع جدیدی از لینوکس ساخته و منتشر کنند اول باید بدانند کرنل لینوکس به تنهایی یک سیستم‌عامل نیست بلکه یک هسته است که با ابزارهایی که روی همان هسته اجرا می‌شوند، به‌عنوان یک سیستم‌عامل کامل قابل استفاده می‌شود. خواه استفاده از ابزارهای گنو و تولید سیستم‌عامل‌های مرسوم گنو/لینوکس و یا روش‌های دیگری مانند اندروید که هسته لینوکس را با ابزارهای ویژه خود به یک سیستم‌عامل کامل تبدیل کرده است.\n\nاگر شما می‌خواهید یک سیستم‌عامل با هسته لینوکس ایجاد کنید برای روش آخر من پیشنهادی ندارم و می‌گویم که کارتان بسیار سخت است چون باید خیلی از ابزارهای اولیه را از نو برنامه‌نویسی کنید اما اگر می‌خواهید یک توزیع جدید گنو/لینوکس ایجاد کنید دو روش پیش رو دارید. یا از توزیع‌های جدید انشعاب بگیرید (که برای هر توزیع ابزارها و روش‌های مشخصی وجود دارد و راحت‌ترین آن‌ها هم انشعاب از ابونتو دسکتاب است) و یا از پایه توزیع گنو/لینوکس خودتان را بسازید!\n\nبهترین منبع برای تولید سامانه گنو/لینوکس از پایه، کتاب `LFS (Linux From Scratch)` است که از آدرس `linuxfromscratch.org` قابل دسترس است.\n\nاما روش بالا مشکلات زیادی دارد. از جمله وقت زیادی که از شما می‌گیرد و دوم اینکه پشتیبانی و بروزرسانی ابزارهای آن طاقت‌فرسا است و بهتر بگویم کار یک گروه خبره است که می‌خواهند واقعا نیازهای جدیدی را در حیطه توزیع‌های پایه پوشش بدهند.\n\nاما روشی که من پیشنهاد می‌کنم استفاده از هسته ابونتو (Ubuntu Core) است! هسته ابونتو در عین اینکه سامانه گنو/لینوکس پایه در اختیار شما می‌گذارد از مزیت‌هایی مانند داشتن مدیر بسته دی‌پی‌کی‌جی و بروزرسانی‌های دائمی ابونتو بهره‌مند است؛ بروزرسانی‌هایی که کارایی و امنیت توزیع شما را تضمین می‌کنند. در عین حال شما می‌توانید خط مشی توزیع خود را کاملا از ابونتو جدا کنید. در ادامه روش برپاسازی این سامانه را مطالعه خواهید کرد.\n\n### برپاسازی هسته ابونتو\n\nابتدا از آدرس `cdimage.ubuntu.com/ubuntu-core/releases/14.04/release` هسته مناسب را دریافت کنید (هسته ابونتو برای ماشین‌های x86 در دو نوع ۳۲ بیت و 64 بیت و arm موجود است).\n\nسپس ترمینالی باز کرده و با کاربر روت وارد شوید.\n\n```sh\nsudo su\n```\n\nاکنون پارتیشن روت سامانه جدید لینوکس را بسازید. برای این مرحله می‌توانید از هر ابزار گرافیکی (gprated) یا خط فرمانی (cfdisk) پارتیشن‌بندی استفاده کنید. پارتیشن روت را به اندازه کافی (بسته به نیازتان در آینده) بگیرید و اگر روی سیستم شما سیستم‌عامل دیگری نیست برچسب بوت آن را فعال کنید.\n\nبا دستور زیر پارتیشن روت خود را فرمت کنید. (sda1 یک مثال از شناسه است و بسته به مرحله قبل متفاوت است).\n\n```sh\nmkfs.ext4 /dev/sda1\n```\n\nپارتیشن روت را در سامانه فعلی مانت کنید تا بتوان از آن استفاده کرد.\n\n```sh\nmkdir /mnt/tmp\nmount /dev/sda1 /mnt/tmp\n```\n\nآرشیو هسته ابونتو را در پارتیشن روت استخراج کنید (مسیر آرشیو را به‌جای <archive.tar.gz> وارد کنید).\n\n```sh\ntar -zxvf <archive.tar.gz> -C /mnt/tmp\n```\n\nوارد مسیر پارتیشن روت شوید.\n\n```sh\ncd /mnt/tmp\n```\n\nگراب را روی دیسک نصب کنید.\n\n```sh\ngrub-install --root-directory=/mnt/tmp /dev/sda\n```\n\nتنظیمات شبکه سامانه فعلی را در سامانه جدید کپی کنید تا بعد از ورود به قلمرو آن (chroot) بتوانید از شبکه سامانه فعلی استفاده کنید.\n\n```sh\ncp /etc/resolv.conf /mnt/tmp/etc/resolv.conf\n```\n\nوارد قلمرو سامانه گنو/لینوکس جدید شوید.\n\n```sh\nfor f in /sys /proc /dev ; do mount --rbind $f /mnt/tmp/$f ; done ; chroot /mnt/tmp\n```\n\nهسته لینوکس را در سامانه جدید نصب کنید (دستور زیر برای زمانی است که سامانه میزبان نیز ابونتو یا دبیان باشد. برای دیگر میزبان‌ها باید هسته مناسب نصب شود و یا اینکه هسته را نیز دریافت کرده و در سامانه جدید کمپایل کنید).\n\n```sh\napt-get update & apt-get install linux-{headers,image}-generic\n```\n\nگراب را آپدیت کنید تا سیستم‌عامل جدید و قبلی‌ها را به لیست منوی خود اضافه کند.\n\n```sh\nupdate-grub\n```\n\nپسورد روت سامانه جدید را ست کنید.\n\n```sh\npasswd\n```\n\nمنابع را آزاد کنید و خارج شوید.\n\n```sh\nexit\ncd ..\numount -v /mnt/tmp/proc\numount -v /mnt/tmp/sys\numount -v /mnt/tmp/dev\numount -v /mnt/tmp/\nexit\n```\n\nتمام شد! اکنون کافی است تا سیستم را ریبوت کنید و از سامانه جدید گنو/لینوکس خود که با هسته ابونتو ساخته‌اید استفاده کنید.\n\nدر صورتی که رم کافی ندارید و نیاز به پارتیشن سواپ دارید می‌توانید بعد از ساخت پارتیشن سواپ به اندازه مناسب از دستورات زیر برای فعال‌سازی آن استفاده کنید.\n\n```sh\nmkswap /dev/sdaX\nswapon /dev/sdaX\n```\n\nبرای اتصال به شبکه اینترنت هم اگر به کابل متصل هستید کافیست دستور زیر را بزنید (eth0 شناسه اولین کارت شبکه شما است و اگر چند کارت شبکه دارید شناسه هر کدام که نیاز است را وارد کنید).\n\n```sh\ndhclient eth0\n```\n\nبرای اتصال به شبکه بی‌سیم هم می‌توانید از دستورات زیر استفاده کنید (در دستور زیر نام و پسورد مناسب را جایگزین کنید).\n\n```sh\niwconfig wlan0 essid name key password\ndhclient wlan0\n```\n\nشما می‌توانید سامانه جدید را بسته به نیازتان سفارش‌سازی کنید، بسته‌های مورد نیاز را تغییر دهید و یا حتی نام توزیع را تغییر و به عنوان یک توزیع جدید منتشر کنید."}},"__N_SSG":true}