{"pageProps":{"page":{"slug":"2015-11-03_what-to-do-after-ubuntu-15-install","layout":"post","jdate":"Tue Nov 03 2015 00:00:00 GMT+0000","user":"saeedhpro","title":"کار بعد از نصب اوبونتو 15.10","categories":["آموزشی"],"tags":["اوبونتو"],"featured":"ubuntu-1510-wily-werewolf.jpg","keywords":["اوبونتو 15.10"],"description":"آموزش کارهایی که بعد از نصب اوبونتو 15.10 باید انجام دهیم","timeToRead":5,"content":"\nبا توجه به این که لازمه بعد از نصب هر سیستم‌عاملی یک سری کارها انجام بدین در این پست قصد دارم تا 10 کاری که بهتره بعد نصب اوبونتو 15.10 انجام دهید رو توضیح بدم.\n\n## 1\\. یادگیری چیزهای جدید\n\nاولین کار، یادگیری چیزهایی جدیدی هست که اضافه شده. چون اوبونتو یه توزیع گنو/لینوکسی هست و افراد زیادی در اون همکاری دارن، چیزهایی جدید به سرعت برای اون ساخته میشن و بعد از تست منتشر میشن!\n\nبه عنوان مثال تو اوبونتو 15.10 میشه با کشیدن برنامه‌ها و ... از دش به دسکتاپ برای اون میانبر ایجاد کرد!\n\n![ubuntu-1510-wily-werewolf](/images/ubuntu-1510-wily-werewolf.jpg)\n\n## 2\\. بررسی بروزرسانی‌ها\n\nبا توجه به اینکه اوبونتو یک سیستم‌عامل open-source هست بروزرسانی‌های اون خیلی سریع اتفاق میفته و پس از بررسی در مخازن برای بروزرسانی سیستم در اختیار عموم قرار می‌گیره که این بروزرسانی‌ها هم باعث رفع باگ‌ها و هم ممکنه باعث افزایش سرعت سیستم و در اختیار گذاشتن امکانات جدید بشه.\n\nبرای بروزرسانی تنها کافیه تا software updater رو باز کنید و روی install now کلیک کنید (مسلما باید به اینترنت وصل باشید!).\n\n![software-updater](/images/software-updater.jpg)\n\n## 3\\. نصب درایور گرافیک\n\nاگه می‌خواید تا عملکرد بهتری از سیستم خود داشته باشید بهتره تا درایور گرافیک اون رو نصب کنید.\n\nاین کار همچنین باعث بهبود سرعت اجرای بازی‌هاتون میشه!\n\nبرای اینکار می‌تونید مطابق عکس زیر عمل کنید:\n\n![drivers](/images/2015/11/drivers.jpg)\n\n## 4\\. نصب کدک های تصویری و صوتی\n\nبا توجه به اینکه اوبونتو جزو نرم‌افزارهای آزاد هست، به طور پیش‌فرض برخی از کدک فرمت‌های تصویری و صوتی مثل mp3 و ... رو نصب نمی کنه و برای نصب اون ها شما دو راه دارید:\n\n1\\. در هنگام نصب قسمتی وجود داره که اتصال شما به اینترنت رو بررسی می کنه. در این بخش یک گزینه وجد داره با عنوان Third-Party codecs و کافیه تیک این گزینه رو فعال کنید!\n\nاگه این کار یادتون رفت ایرادی نداره چون با روش زیر می تونید بعد از نصب اوبونتو اقدام به نصب اینم کدک‌ها بکنید:\n\n2\\. ubuntu software center رو باز کنید و عبارت `third party codecs` زیر رو جست‌وجو کنید و بعد اون رو نصب کنید و یا روی لینک [Install Third-Party Codecs ](https://apps.ubuntu.com/cat/applications/ubuntu-restricted-extras/)کلیک کنید.\n\n**منتظر بخش دوم باشید!**\n\n**منبع: [saeedhpro.ir](http://saeedhpro.ir/)**"}},"__N_SSG":true}