{"pageProps":{"page":{"slug":"2016-07-25_vsftpd","layout":"post","jdate":"Mon Jul 25 2016 00:00:00 GMT+0000","user":"rmasoumvand","title":"راه اندازی vsftpd در دبیان","categories":["آموزشی"],"tags":["پیکربندی","سرور"],"featured":"vsftpd-debian.jpg","keywords":["vsftpd","linux ftp server"],"description":"راه اندازی vsftpd در دبیان","timeToRead":5,"content":"\nFTP مخفف File Transfer Protocol یا پروتکل انتقال فایل است که برای انتقال فایل‌ها و اشتراک گذاری آن‌ها در شبکه به‌کار می‌رود. سرویس‌دهنده‌های بسیاری تحت این پروتکل برای ارائه این سرویس نوشته شده است که یکی از مشهورترین و امن‌ترین آن‌ها vsftpd است که در این آموزش به نصب و راه اندازی آن خواهیم پرداخت.\n\nبرای نصب بسته vsftpd دستور زیر را وارد می‌کنیم.\n\n```sh  \nsudo apt-get install vsftpd  \n```\n\nسپس می‌بایست مانند زیر فایل `etc/vsftpd.conf/` را ویرایش نموده و تغییرات زیر را اعمال می‌کنیم.\n\nبه‌صورت پیش‌فرض vsftpd برای سرویس‌دهی روی پروتکل IPv6 پیکربندی شده است. پس در صورتی که در شبکه از IPv6 استفاده نمی‌کنید می‌بایست به‌صورت زیر عمل کنید.\n\nابتدا خط زیر را از حالت توضیحات خارج نموده و مقدار آن را به YES تغییر دهید.\n\n```sh  \nlisten=YES  \n```\n\nو سپس مقدار خط زیر را به NO تغییر دهید.\n\n```sh  \nlisten_ipv6=NO  \n```\n\nدر حالت پیش‌فرض سرویس‌دهنده به‌صورت Anonymous FTP پیکربندی شده است. در این حالت هر کاربری با نام کاربری Anonymous و هر رمز عبوری می‌تواند از سرویس استفاده نماید و فایل‌های اشتراک گذاشته شده را مشاهده کند. در صورتی که می‌خواهید فقط کاربران مجاز امکان استفاده از سرویس را داشته باشند می بایست حالت Anonymous را غیرفعال کنید.\n\n```sh  \nanonymous_enable=NO  \n```\n\n* نکته)‌ معمولاً از حالت Anonymous FTP در سرویس های Public که نیاز به تأیید اعتبار ندارند استفاده می‌شود.\n\nسپس جهت فعال نمودن اجازه دسترسی کاربران مجاز خطوط زیر را از حالت توضییحات خارج نمایید و مقدار انرا از NO به YES تغییر دهید.\n\n```sh  \nlocal_enable=YES  \n```\n\nو برای اجازه نوشتن توسط کاربران خط زیر را از حالت توضییحات خارج نموده و مقدار آن را به‌صورت زیر تغییر می‌دهیم.\n\n```sh  \nwrite_enable=YES  \n```\n\nسپس خط زیر را از حالت توضییحات خارج می‌کنیم.\n\n```sh  \nchroot_local_user=YES  \n```\n\n*‌ نکته) در نسخه‌های جدیدتر vsfptd امکان اجرای سرویس با حالت `chroot_local_user` وجود ندارد که برای حل این مشکل می‌بایست خط زیر را در فایل پیکربندی وارد کنیم.\n\n```sh  \nallow_writeable_chroot=YES  \n```\n\nدر پایان دستور زیر را برای راه اندازی مجدد سرویس‌دهنده‌ی vsftpd وارد نمایید.\n\n```sh  \nsystemctl restart vsftpd.service  \n```\n"}},"__N_SSG":true}