{"pageProps":{"page":{"slug":"2017-04-22_kde-nm-connection-editor","layout":"post","jdate":"Sat Apr 22 2017 00:00:00 GMT+0000","user":"amirhne","title":"ساخت هات‌اسپات در اوبونتو ۱۶.۰۴","categories":["آموزشی"],"tags":["اوبونتو","شبکه"],"featured":"kde-nm-connection-editor.png","keywords":["هات اسپات اوبونتو"],"description":"آموزش ساخت هات اسپات و به اشتراک گذاری اینترنت در اوبونتو ۱۶.۰۴","timeToRead":5,"content":"\nدر خیلی از شرایط نیاز هست که ارتباط شبکه خود را که به‌صورت LAN دریافت کرده‌اید روی وایرلس با دیگران به اشتراک بگذارید.\nدر محیط ویندوز نرم‌افزارهایی مانند connectify و ... وجود دارد که با استفاده از کارت شبکه وایرلس شما، شبکه و اینترنت شما روی وایرلس به اشتراک می‌گذارد.\nدر محیط اوبونتو نیز میتوان این امر را با استفاده از `kde nm connection editor` انجام داد.\n\n![kde nm connection editor](/images/kde-nm-connection-editor.png )\n\n### پیش‌نیاز ها\n\n\n*   سیستم عامل اوبونتو ۱۲.۰۴ به بالا\n*   کارت شبکه LAN\n*   کارت شبکه وایرلس\n*   اتصال به یک شبکه یا به اینترنت از طریق LAN\n\n\n\nدر ابتدا بایستی پکیج های مورد نیاز برای نصب kde nm connection editor را از نصب کنید که خوشبختانه در ریپازیتوری خود اوبونتو موجود است.\n\n```sh\nsudo apt-get install plasma-nm\n```\n\n\n\nبعد از نصب پکیج مربوطه alt+f2 بزنید.\nو متن kde-nm-connection-editor جستوجو کنید و روی اولین گزینه کلیک کنید.\n![kde nm connection editor search](/images/kde-nm1.png )\n\n\n\n\nبعد باز شدن برنامه بر روی گزینه add کلیک کنید و بر روی Wireless(shared) کلیک کنید.\n![kde nm connection editor open](/images/kde-nm2.png )\n\n\n\n\nدر صفحه جدید تنظیمات وایرلس خود مانند نام، رمز عبور، نوع رمزنگاری و غیره را تعیین کنید.\n![kde nm connection editor create](/images/kde-nm3.png )\n\n\n\nبعد از ساخته شدن کانکشن در نوار بالا بر روی منو شبکه unity کلیک کنید و گزینه Connect to Hidden Wi-Fi network کلیک کنید و در صفحه جدید  کانکشنی که ساختید را انتخاب کنید.\n![kde nm connection editor create](/images/kde-nm4.png )\n\n\nدر صورتی که تمام مراحل را به درستی انجام داده باشید و ارتباط کارت شبکه های شما توسط سیستم عامل شناسایی شده باشند، وایرلس شما ساخته شده است و دستگاه های خود را میتوانید به آن متصل کنید.\n\nمتاسفانه در این حالت هیچگونه دسترسی برای تغییرات در DHCP و NAT وجود ندارد.\n\nامیدوارم که این آموزش مفید واقع شده باشه...\n"}},"__N_SSG":true}